[
  {
      "id": 238,
      "title": "The Godfather",
      "tagline": "An offer you can't refuse.",
      "vote_average": 8.5,
      "vote_count": 7437,
      "release_date": "1972-03-14",
      "poster_path": "https://image.tmdb.org/t/p/w500/rPdtLWNsZmAtoZl9PK7S2wE3qiS.jpg",
      "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
      "budget": 6000000,
      "revenue": 245066411,
      "genres": [
        "Drama",
        "Crime"
      ],
      "runtime": 175
    },
    {
      "id": 418827,
      "title": "Sister's Younger Husband",
      "tagline": "A sexy brother-in-law approached her? And he’s a younger man?",
      "vote_average": 8.5,
      "vote_count": 2,
      "release_date": "2016-10-11",
      "poster_path": "https://image.tmdb.org/t/p/w500/wKCkyb7dyDTbZn7qy6zh8oqtFrT.jpg",
      "overview": "A sexy brother-in-law approached her? And he’s a younger man?  Mi-yeon, who was adopted into her family when she was little, is living with her older sister, Si-yeon and Si-yeon’s husband. Mi-yeon’s desire towards her brother-in-law grows more and more every night when she gets to watch the affectionate interaction between her older sister and the brother-in-law. One day, Mi-yeon seduces her brother-in-law and the two end up crossing the line when they should not have. As the situation goes on, Mi-yeon finds out her older sister is also having affairs outside the marriage. Mi-yeon tries to clear up the relationship with her brother-in-law out of guilty feeling. However, she hears something shocking from the brother-in-law.",
      "budget": 0,
      "revenue": 0,
      "genres": [
        "Comedy",
        "Drama",
        "Romance"
      ],
      "runtime": 75
    },
    {
      "id": 372058,
      "title": "Your Name.",
      "tagline": "",
      "vote_average": 8.5,
      "vote_count": 2129,
      "release_date": "2016-08-26",
      "poster_path": "https://image.tmdb.org/t/p/w500/xq1Ugd62d23K2knRUx6xxuALTZB.jpg",
      "overview": "High schoolers Mitsuha and Taki are complete strangers living separate lives. But one night, they suddenly switch places. Mitsuha wakes up in Taki’s body, and he in hers. This bizarre occurrence continues to happen randomly, and the two must adjust their lives around each other.",
      "budget": 0,
      "revenue": 355398372,
      "genres": [
        "Romance",
        "Animation",
        "Drama"
      ],
      "runtime": 106
    },
    {
      "id": 129,
      "title": "Spirited Away",
      "tagline": "",
      "vote_average": 8.4,
      "vote_count": 5095,
      "release_date": "2001-07-20",
      "poster_path": "https://image.tmdb.org/t/p/w500/dL11DBPcRhWWnJcFXl9A07MrqTI.jpg",
      "overview": "A young girl, Chihiro, becomes trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free her family.",
      "budget": 15000000,
      "revenue": 274925095,
      "genres": [
        "Animation",
        "Family",
        "Fantasy"
      ],
      "runtime": 125
    },
    {
      "id": 240,
      "title": "The Godfather: Part II",
      "tagline": "I don't feel I have to wipe everybody out, Tom. Just my enemies.",
      "vote_average": 8.4,
      "vote_count": 4308,
      "release_date": "1974-12-20",
      "poster_path": "https://image.tmdb.org/t/p/w500/bVq65huQ8vHDd1a4Z37QtuyEvpA.jpg",
      "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
      "budget": 13000000,
      "revenue": 102600000,
      "genres": [
        "Drama",
        "Crime"
      ],
      "runtime": 200
    }
]